Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71J20.PIC
      <edc:SFRDef edc:_addr="0x40038228" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR2" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003822C" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR3" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038230" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR4" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038234" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR5" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038238" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR6" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003823C" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR7" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038240" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR8" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038244" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR9" edc:impl="0xB50FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038248" edc:offset="0xC8"/>
      <edc:SFRDef edc:_addr="0x40038310" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA0USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038314" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA0USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
