Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71J20.PIC
      <edc:SFRDef edc:_addr="0x4003876C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_HSTDMA5USBHS_HSTDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038770" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA6USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038774" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA6USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038778" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_HSTDMA6USBHS_HSTDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003877C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_HSTDMA6USBHS_HSTDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038780" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x40038800" edc:access="------nn--------nn-----n---n----" edc:cname="USBHS_CTRL" edc:impl="0x300C110" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRE" edc:desc="Remote Device Connection Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VBUSHWC" edc:desc="VBUS Hardware Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FRZCLK" edc:desc="Freeze USB Clock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBE" edc:desc="USBHS Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="UID" edc:desc="UID Pin Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UIMOD" edc:desc="USBHS Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HOST" edc:desc="The module is in USB Host mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DEVICE" edc:desc="The module is in USB Device mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038804" edc:access="-----------------rrr-------r----" edc:cname="USBHS_SR" edc:impl="0x7010" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RDERRI" edc:desc="Remote Device Connection Error Interrupt (Host mode only)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="Speed Status (Device mode only)" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FULL_SPEED" edc:desc="Full-Speed mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="High-Speed mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOW_SPEED" edc:desc="Low-Speed mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKUSABLE" edc:desc="UTMI Clock Usable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
