Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.38/samv71/edc/ATSAMV71J20.PIC
      <edc:SFRDef edc:_addr="0xE000E4E4" edc:access="nnnnnnnn" edc:cname="IP228" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4E5" edc:access="nnnnnnnn" edc:cname="IP229" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4E6" edc:access="nnnnnnnn" edc:cname="IP230" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4E7" edc:access="nnnnnnnn" edc:cname="IP231" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4E8" edc:access="nnnnnnnn" edc:cname="IP232" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4E9" edc:access="nnnnnnnn" edc:cname="IP233" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4EA" edc:access="nnnnnnnn" edc:cname="IP234" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4EB" edc:access="nnnnnnnn" edc:cname="IP235" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4EC" edc:access="nnnnnnnn" edc:cname="IP236" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4ED" edc:access="nnnnnnnn" edc:cname="IP237" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4EE" edc:access="nnnnnnnn" edc:cname="IP238" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E4EF" edc:access="nnnnnnnn" edc:cname="IP239" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI0" edc:desc="Priority of interrupt 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E4F0" edc:offset="0x810"/>
      <edc:SFRDef edc:_addr="0xE000ED00" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CPUID" edc:mclr="01000001000111111100001001110001" edc:nzwidth="0x20" edc:por="01000001000111111100001001110001" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Indicates patch release: 0x0 = Patch 0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PARTNO" edc:desc="Indicates part number" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHITECTURE" edc:desc="Indicates architecture. Reads as 0xF" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VARIANT" edc:desc="Indicates processor revision: 0x2 = Revision 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="IMPLEMENTER" edc:desc="Implementer code" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED04" edc:access="n--nnnn-nn----nnnnnnn--nnnnnnnnn" edc:cname="ICSR" edc:impl="0x9EC3F9FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="VECTACTIVE" edc:desc="Active exception number" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RETTOBASE" edc:desc="Indicates whether there is an active exception other than the exception indicated by the current value of the IPSR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="there are preempted active exceptions to execute" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="there are no active exceptions, or the currently-executing exception is the only active exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VECTPENDING" edc:desc="Exception number of the highest priority pending enabled exception" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ISRPENDING" edc:desc="Is external interrupt, generated by the NVIC, pending" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISRPREEMPT" edc:desc="Indicates whether a pending exception will be serviced on exit from debug halt state" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Will not service" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Will service a pending exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDSTCLR" edc:desc="Removes the pending status of the SysTick exception" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no effect" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="removes the pending state from the SysTick exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSTSET" edc:desc="Sets the SysTick exception as pending, or reads the current state of the exception" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="write: no effect; read: SysTick exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="write: changes SysTick exception state to pending; read: SysTick exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSVCLR" edc:desc="Removes the pending status of the PendSV exception" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no effect" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="removes the pending state from the PendSV exception" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PENDSVSET" edc:desc="Sets the PendSV exception as pending, or reads the current state of the exception" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="write: no effect; read: PendSV exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="write: changes PendSV exception state to pending; read: PendSV exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NMIPENDSET" edc:desc="Makes the NMI exception active, or reads the state of the exception" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="write: no effect; read: NMI exception is not pending" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="write: changes NMI exception state to pending; read: NMI exception is pending" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED08" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="VTOR" edc:impl="0xFFFFFF80" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TBLOFF" edc:desc="Bits[31:7] of the vector table address" edc:nzwidth="0x19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
